In [1]:
#pandas
import pandas as pd
import numpy as np

In [28]:
df=pd.read_csv("person.csv")

In [3]:
df.head()

     name  age
0    ravi   23
1  sourav   34
2  sachin   23

In [4]:
#value of column
df.age

0    23
1    34
2    23
Name: age, dtype: int64

In [5]:
df.name

0      ravi
1    sourav
2    sachin
Name: name, dtype: object

In [7]:
df["name"]

0      ravi
1    sourav
2    sachin
Name: name, dtype: object

In [9]:
#for more than one column
df[["age","name"]]

   age    name
0   23    ravi
1   34  sourav
2   23  sachin

In [10]:
df

     name  age
0    ravi   23
1  sourav   34
2  sachin   23

In [12]:
df[0:1]

   name  age
0  ravi   23

In [13]:
df[:2]

     name  age
0    ravi   23
1  sourav   34

In [14]:
df[::-1]

     name  age
2  sachin   23
1  sourav   34
0    ravi   23

In [17]:
df[1:]["name"]

1    sourav
2    sachin
Name: name, dtype: object

In [29]:
df["branch"]=["cse","me","ce"]

In [23]:
df

   0  1  2 branch
0  3  4  5    cse
1  1  2  3     me
2  2  4  6     ce

In [30]:
df["marks"]=[100,45,25]

In [31]:
df

     name  age branch  marks
0    ravi   23    cse    100
1  sourav   34     me     45
2  sachin   23     ce     25

In [32]:
df.loc[1:,"name"]

1    sourav
2    sachin
Name: name, dtype: object

In [33]:
df.set_index("name",inplace=True)

In [34]:
df

        age branch  marks
name
ravi     23    cse    100
sourav   34     me     45
sachin   23     ce     25

In [35]:
df.loc["sourav"]

age       34
branch    me
marks     45
Name: sourav, dtype: object

In [36]:
df

        age branch  marks
name
ravi     23    cse    100
sourav   34     me     45
sachin   23     ce     25

In [38]:
df.loc["sourav","marks"]

45

In [39]:
df.loc[["sourav","ravi"],["marks","branch"]]

        marks branch
name
sourav     45     me
ravi      100    cse

In [40]:
df["eligible"]=np.where(df["age"]>18,"yes","no")

In [41]:
df

        age branch  marks eligible
name
ravi     23    cse    100      yes
sourav   34     me     45      yes
sachin   23     ce     25      yes

In [42]:
df.iloc[1]

age          34
branch       me
marks        45
eligible    yes
Name: sourav, dtype: object

In [46]:
df.iloc[1:3,1:3]

       branch  marks
name
sourav     me     45
sachin     ce     25

In [47]:
df

        age branch  marks eligible
name
ravi     23    cse    100      yes
sourav   34     me     45      yes
sachin   23     ce     25      yes

In [49]:
#students marks greater than 50
df.loc[df["marks"]>40]

        age branch  marks eligible
name
ravi     23    cse    100      yes
sourav   34     me     45      yes

In [50]:
df.loc[df["marks"]>40].index

Index(['ravi', 'sourav'], dtype='object', name='name')

In [53]:
df

        age branch  marks eligible
name
ravi     23    cse    100      yes
sourav   34     me     45      yes
sachin   23     ce     25      yes

In [54]:
#delete column
df.drop("eligible",inplace=True,axis=1)

In [55]:
df

        age branch  marks
name
ravi     23    cse    100
sourav   34     me     45
sachin   23     ce     25

In [56]:
#delete row
df.drop("sourav",inplace=True,axis=0)

In [57]:
df

        age branch  marks
name
ravi     23    cse    100
sachin   23     ce     25

In [58]:
df.describe()

        age       marks
count   2.0    2.000000
mean   23.0   62.500000
std     0.0   53.033009
min    23.0   25.000000
25%    23.0   43.750000
50%    23.0   62.500000
75%    23.0   81.250000
max    23.0  100.000000

In [61]:
df.describe(include=np.number)

        age       marks
count   2.0    2.000000
mean   23.0   62.500000
std     0.0   53.033009
min    23.0   25.000000
25%    23.0   43.750000
50%    23.0   62.500000
75%    23.0   81.250000
max    23.0  100.000000

In [62]:
df.describe(include=np.object)

       branch
count       2
unique      2
top       cse
freq        1

In [63]:
df.describe(exclude=np.number)

       branch
count       2
unique      2
top       cse
freq        1

In [64]:
df.describe(include="all")

         age branch       marks
count    2.0      2    2.000000
unique   NaN      2         NaN
top      NaN    cse         NaN
freq     NaN      1         NaN
mean    23.0    NaN   62.500000
std      0.0    NaN   53.033009
min     23.0    NaN   25.000000
25%     23.0    NaN   43.750000
50%     23.0    NaN   62.500000
75%     23.0    NaN   81.250000
max     23.0    NaN  100.000000

In [65]:
#attributes and methods

In [66]:
df.axes

[Index(['ravi', 'sachin'], dtype='object', name='name'),
 Index(['age', 'branch', 'marks'], dtype='object')]

In [67]:
df

        age branch  marks
name
ravi     23    cse    100
sachin   23     ce     25

In [69]:
df.empty
#tells whether datafame empty or not

False

In [70]:
df.values

array([[23, 'cse', 100],
       [23, 'ce', 25]], dtype=object)

In [71]:
df.index

Index(['ravi', 'sachin'], dtype='object', name='name')

In [72]:
df.columns

Index(['age', 'branch', 'marks'], dtype='object')

In [73]:
df.T

name   ravi sachin
age      23     23
branch  cse     ce
marks   100     25

In [74]:
df

        age branch  marks
name
ravi     23    cse    100
sachin   23     ce     25

In [76]:
#statistical method
df.sum()

age          46
branch    csece
marks       125
dtype: object

In [78]:
df.sum(axis=1)
#column wise sum

name
ravi      123
sachin     48
dtype: int64

In [79]:
df.mean()

age      23.0
marks    62.5
dtype: float64

In [80]:
df.mean(axis=1)

name
ravi      61.5
sachin    24.0
dtype: float64

In [81]:
df.std()

age       0.000000
marks    53.033009
dtype: float64

In [83]:
df.count()
#count no. of rows

age       2
branch    2
marks     2
dtype: int64

In [84]:
df.count(axis=1)

name
ravi      3
sachin    3
dtype: int64

In [85]:
df.median()

age      23.0
marks    62.5
dtype: float64

In [86]:
df.mode()

    age branch  marks
0  23.0     ce     25
1   NaN    cse    100

In [87]:
df.drop("branch",axis=1).abs()

        age  marks
name
ravi     23    100
sachin   23     25

In [94]:
df.prod()

age       529
marks    2500
dtype: int64

In [92]:
df.cumsum()

       age branch marks
name
ravi    23    cse   100
sachin  46  csece   125

In [93]:
df.drop("branch",axis=1).cumprod()

        age  marks
name
ravi     23    100
sachin  529   2500

In [95]:
#to apply function across table

In [96]:
df.drop("branch",axis=1,inplace=True)

In [97]:
df

        age  marks
name
ravi     23    100
sachin   23     25

In [98]:
#pipe(func,value)---it apply function across table
df.pipe(lambda x,y:x+y,4)

        age  marks
name
ravi     27    104
sachin   27     29

In [102]:
#apply(function)-----it will apply across row or column
df.apply(np.sum,axis=1)#row wise

name
ravi      123
sachin     48
dtype: int64

In [101]:
df.apply(np.sum,axis=0)#column wise

age       46
marks    125
dtype: int64

In [103]:
df

        age  marks
name
ravi     23    100
sachin   23     25

In [104]:
browser=pd.read_csv("browser.csv")

In [105]:
browser.head()

     browser  http_status  response_time
0     chrome          200          12.20
1    firefox          102           1.30
2     safari          200          45.20
3  iexplorer          404          12.34

In [106]:
browser.set_index("browser",inplace=True)

In [107]:
browser

           http_status  response_time
browser
chrome             200          12.20
firefox            102           1.30
safari             200          45.20
iexplorer          404          12.34

In [108]:
#reindex
browser.reindex(["firefox",
                 "edge",
                 "safari",
                 "explorer",
                 "chrome",
                "opera"])

          http_status  response_time
browser
firefox         102.0            1.3
edge              NaN            NaN
safari          200.0           45.2
explorer          NaN            NaN
chrome          200.0           12.2
opera             NaN            NaN

In [109]:
browser

           http_status  response_time
browser
chrome             200          12.20
firefox            102           1.30
safari             200          45.20
iexplorer          404          12.34

In [110]:
browser.reindex(["firefox",
                 "edge",
                 "safari",
                 "explorer",
                 "chrome",
                "opera"],fill_value=0)

          http_status  response_time
browser
firefox           102            1.3
edge                0            0.0
safari            200           45.2
explorer            0            0.0
chrome            200           12.2
opera               0            0.0

In [111]:
browser.reindex(columns=["response_time",
                         "user_age",
                         "http_status"])

           response_time  user_age  http_status
browser
chrome             12.20       NaN          200
firefox             1.30       NaN          102
safari             45.20       NaN          200
iexplorer          12.34       NaN          404

In [113]:
browser.reindex(columns=["response_time",
                         "user_age",
                         "http_status"],fill_value="missing")

           response_time user_age  http_status
browser
chrome             12.20  missing          200
firefox             1.30  missing          102
safari             45.20  missing          200
iexplorer          12.34  missing          404

In [114]:
browser

           http_status  response_time
browser
chrome             200          12.20
firefox            102           1.30
safari             200          45.20
iexplorer          404          12.34

In [115]:
#range of data

In [119]:
date=pd.date_range("1/1/2015",periods=3,freq="D")
#D for day

In [120]:
print(date)

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-03'], dtype='datetime64[ns]', freq='D')

In [123]:
date=pd.date_range("1/1/2015",periods=3,freq="M")
#time interval ---month

In [122]:
date

DatetimeIndex(['2015-01-31', '2015-02-28', '2015-03-31'], dtype='datetime64[ns]', freq='M')

In [124]:
date=pd.date_range("1/1/2018",periods=10,freq="D")

In [128]:
p_prices=pd.DataFrame([70.34,np.nan,78.34,80.23,67,77.34,np.nan,74.04,83.23,np.nan],index=date,columns=["prices"])

In [129]:
p_prices

            prices
2018-01-01   70.34
2018-01-02     NaN
2018-01-03   78.34
2018-01-04   80.23
2018-01-05   67.00
2018-01-06   77.34
2018-01-07     NaN
2018-01-08   74.04
2018-01-09   83.23
2018-01-10     NaN

In [130]:
date=pd.date_range("28/12/2017",periods=15,freq="D")

In [131]:
p_prices.reindex(date)

            prices
2017-12-28     NaN
2017-12-29     NaN
2017-12-30     NaN
2017-12-31     NaN
2018-01-01   70.34
2018-01-02     NaN
2018-01-03   78.34
2018-01-04   80.23
2018-01-05   67.00
2018-01-06   77.34
2018-01-07     NaN
2018-01-08   74.04
2018-01-09   83.23
2018-01-10     NaN
2018-01-11     NaN

In [133]:
p_prices.reindex(date,method="bfill")
#backward fill

            prices
2017-12-28   70.34
2017-12-29   70.34
2017-12-30   70.34
2017-12-31   70.34
2018-01-01   70.34
2018-01-02     NaN
2018-01-03   78.34
2018-01-04   80.23
2018-01-05   67.00
2018-01-06   77.34
2018-01-07     NaN
2018-01-08   74.04
2018-01-09   83.23
2018-01-10     NaN
2018-01-11     NaN

In [138]:
p_prices.reindex(date,method="ffill")
#forward fill

            prices
2017-12-28     NaN
2017-12-29     NaN
2017-12-30     NaN
2017-12-31     NaN
2018-01-01   70.34
2018-01-02     NaN
2018-01-03   78.34
2018-01-04   80.23
2018-01-05   67.00
2018-01-06   77.34
2018-01-07     NaN
2018-01-08   74.04
2018-01-09   83.23
2018-01-10     NaN
2018-01-11     NaN

In [137]:
p_prices.reindex(date,method="bfill",limit=2)

            prices
2017-12-28     NaN
2017-12-29     NaN
2017-12-30   70.34
2017-12-31   70.34
2018-01-01   70.34
2018-01-02     NaN
2018-01-03   78.34
2018-01-04   80.23
2018-01-05   67.00
2018-01-06   77.34
2018-01-07     NaN
2018-01-08   74.04
2018-01-09   83.23
2018-01-10     NaN
2018-01-11     NaN